www/pregel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>pregel</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="pregel"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-24 23:09:23 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">pregel</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 pregel</a>
<ul>
<li><a href="#sec-1-1">1.1 Abstract</a></li>
<li><a href="#sec-1-2">1.2 Introduction</a></li>
<li><a href="#sec-1-3">1.3 Model of Computation</a></li>
<li><a href="#sec-1-4">1.4 The C++ API</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 Message Passing</a></li>
<li><a href="#sec-1-4-2">1.4.2 Combiners</a></li>
<li><a href="#sec-1-4-3">1.4.3 Aggregators</a></li>
<li><a href="#sec-1-4-4">1.4.4 Topology Mutations</a></li>
<li><a href="#sec-1-4-5">1.4.5 Input and Output</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 Implementation</a></li>
<li><a href="#sec-1-6">1.6 Applications</a></li>
<li><a href="#sec-1-7">1.7 Experiments</a></li>
<li><a href="#sec-1-8">1.8 Related Work</a></li>
<li><a href="#sec-1-9">1.9 Conclusion and Future Work</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> pregel</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="http://kowshik.github.com/JPregel/pregel_paper.pdf">http://kowshik.github.com/JPregel/pregel_paper.pdf</a>
</li>
<li>JPregel @ GitHub <a href="http://kowshik.github.com/JPregel/">http://kowshik.github.com/JPregel/</a> 
</li>
<li>Pregel: Google’s other data-processing infrastructure  <a href="http://www.royans.net/arch/pregel-googles-other-data-processing-infrastructure/">http://www.royans.net/arch/pregel-googles-other-data-processing-infrastructure/</a>
</li>
<li>Pregel: A System for Large-Scale Graph Processing <a href="http://www.slideshare.net/shatteredNirvana/pregel-a-system-for-largescale-graph-processing">http://www.slideshare.net/shatteredNirvana/pregel-a-system-for-largescale-graph-processing</a>

</li>
<li>title: Pregel: A System for Large-Scale Graph Processing
</li>
<li>authors: {malewicz,austern,ajcbik,dehnert,ilan,naty,gczaj}@google.com
</li>
<li>date: 2010
</li>
</ul>


<p>
<b>The name honors Leonhard Euler. The Bridges of Konigsberg, which inspired his famous theorem, spanned the Pregel river</b> （Euler回路起源就是Konigsberg桥问题，而这个桥就在Pregel River上面）
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Abstract</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Programs are expressed as a sequence of iterations, in each of which a vertex can receive messages sent in the previous iteration, send mes-sages to other vertices, and modify its own state and that of its outgoing edges or mutate graph topology. (主要是为了解决大规模图算法的问题。程序分为多次迭代地执行，每次迭代在顶点上面处理上次迭代接受到的消息，产生消息发送到其他节点，并且修改自身的状态，或者修改其出边，或者是修改整个图的拓扑结构)
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Introduction</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>The Internet made the Web graph a popular object of analysis and research. Web 2.0 fueled interest in social net-works. Other large graphs—for example induced by trans-portation routes, similarity of newspaper articles, paths of disease outbreaks, or citation relationships among published scientific work—have been processed for decades. （相当数量大规模图算法的应用）
</li>
<li>Efficient processing of large graphs is challenging. （图算法本身特点，这些在设计框架的时候需要考虑）
<ul>
<li>Graph algorithms often exhibit poor locality of memory access, （locality非常差，需要访问其他节点产生的数据）
</li>
<li>very little work per vertex, and （每个节点计算量并不大，主要还是多轮大量节点的迭代效果）
</li>
<li>a changing degree of parallelism over the course of execution [31, 39]. （在执行过程中需要不断地修改并行度/图的拓扑结构）
</li>
</ul>

</li>
<li>Distribution over many machines exacerbates the locality issue, and increases the probability that a machine will fail during computation.（分布式需要考虑locality问题，并且还需要failover的情况）
</li>
<li>MapReduce [14，], for example, is a very good fit for a wide array of large-scale computing problems. It is sometimes used to mine large graphs [11, 30], but this can lead to sub-optimal performance and usability issues. The basic models for processing data have been extended to fa-cilitate aggregation [41，] and SQL-like queries [40, 47], but these extensions are usually not ideal for graph al-gorithms that often better fit a message passing model.（对于MR来说非常适合大规模的计算问题，并且有时候能够用来最一些挖掘工作，但是并不是最优的解决方案，并且还需要考虑一些可用性问题。本质上对于图算法来说的话，使用消息传递机制会更加合适。/另外MR计算方式和图算法似乎还需要一个转换过程，而并不是intuitive的）
</li>
</ul>



<hr/>

<ul>
<li>Pregel computations consist of a sequence of iterations, called su-persteps. During a superstep the framework invokes a user-defined function for each vertex, conceptually in parallel. （每次迭代称为superstep，在每个superstep框架会调用每个vertex的自定义函数，这个过程是并行都的）
</li>
<li>The function specifies behavior at a single vertex V and a single superstep S. It can read messages sent to V in su-perstep S − 1, send messages to other vertices that will be received at superstep S + 1, and modify the state of V and its outgoing edges. （每个节点会读取S-1时候其他节点发送给它的小心，处理完成之后就可以向其他节点发送消息，让这些节点在S+1时候处理。同时还可以修改整个图的拓扑结构）
</li>
<li>Messages are typically sent along outgo-ing edges, but a message may be sent to any vertex whose identifier is known.（message并不一定是要随着outgoing edges，而是可以发送到任何节点）。
</li>
<li>The vertex-centric approach is reminiscent of MapReduce in that users focus on a local action, processing each item independently, and the system composes these actions to lift computation to a large dataset. By design the model is well suited for distributed implementations: it doesn’t expose any mechanism for detecting order of execution within a superstep, and all communication is from superstep S to superstep S + 1.（以节点为中心的设计方式和MR非常像，用户只需要关于一个本地计算，对于每个item单独处理然后合并在一起形成一个大数据。这种设计是非常适合分布式的，对于一个superstep内部来说没有定义执行顺序，所有通信都是从S-》S+1之间的）
</li>
<li>The synchronicity of this model makes it easier to reason about program semantics when implementing algorithms, and ensures that Pregel programs are inherently free of dead-locks and data races common in asynchronous systems.（以同步的方式可以更好地对program进行reason，并且可以使得整个系统避免死锁）
</li>
<li>In principle the performance of Pregel programs should be com-petitive with that of asynchronous systems given enough parallel slack [28, 34]. Because typical graph computations have many more vertices than machines, one should be able to balance the machine loads so that the synchronization between supersteps does not add excessive latency. <b>TODO（dirlt）：怎么定义异步模式？是否如果工作异步模式的话，就没有superstep这个概念？</b> （因为节点数目远大于机器，因此整个分布式非常均匀的，因此采用同步的方式并不会带来太多的延迟，大部分节点完成时间是相同的，不会存在某个节点计算时间过长，否则采用异步方式会使得延迟更小。） <b>NOTE（dirlt）：但是异步方式会使得程序更加难懂，因为缺少一个barrier，V1可能计算到了Step3，而V2可能只是计算到Step1。此外也比较难确定一个节点什么时候需要计算下一轮，需要很多额外的描述</b>
</li>
</ul>


</div>

</div>
