www/pregel.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Model of Computation</h3>
<div class="outline-text-3" id="text-1-3">

<ul>
<li>The input to a Pregel computation is a directed graph in which each vertex is uniquely identified by a string vertex identifier. Each vertex is associated with a modifiable, user defined value. The directed edges are associated with their source vertices, and each edge consists of a modifiable, user defined value and a target vertex identifier.（pregel的输入就是一个有向图，每个节点都有一个唯一标识，并且有一个相应的自定义可修改数据。edge对应了source和target vertex，并且上面也有自定义数据） 。 但是注意 <b>Edges are not first-class citizens in this model, having no associated computation.</b> 对于edge来说并不是first-class，pregel是vertex-centric模式，edge上面没有对应任何计算。 *NOTE（dirlt）：不过既然vertex为中心，就没有必要指定edge上的输入吧！
</li>
<li>A typical Pregel computation consists of input, when the graph is initialized, followed by a sequence of supersteps sep-arated by global synchronization points until the algorithm terminates, and finishing with output.（有一个全局的同步点机制，每轮迭代都会进行同步）
</li>
<li>Within each superstep the vertices compute in parallel, each executing the same user-defined function that expresses the logic of a given algorithm. A vertex can modify its state or that of its outgoing edges, receive messages sent to it in the previous superstep, send messages to other vertices (to be received in the next superstep), or even mutate the topology of the graph.（在每一个superstep里面每个节点都会指定自定义函数，节点可以修改自身状态以及出口，接受上一步产生的信息并且写新的消息到其他节点，甚至修改全局拓扑）。 <b>NOTE（dirlt）：修改全局拓扑似乎是一个比较难实现的东西</b>
</li>
<li>Algorithm termination is based on every vertex voting to halt. In superstep 0, every vertex is in the active state; all active vertices participate in the computation of any given superstep. A vertex deactivates itself by voting to halt. This means that the vertex has no further work to do unless trig-gered externally, and the Pregel framework will not execute that vertex in subsequent supersteps unless it receives a mes-sage. If reactivated by a message, a vertex must explicitly deactivate itself again. The algorithm as a whole terminates when all vertices are simultaneously inactive and there are no messages in transit.（起初每个节点都是active的，节点变为inactive需要自己vote to halt，这样节点下次就不会参与计算了。但是如果其他节点向这个节点发送消息的话，那么又会从inactive变为active状态。因此pregel的终止状态是所有节点都已经vote to halt并且没有任何message流动）
</li>
<li>The output of a Pregel program is the set of values ex-plicitly output by the vertices. It is often a directed graph isomorphic to the input, but this is not a necessary prop-erty of the system because vertices and edges can be added and removed during computation. A clustering algorithm, for example, might generate a small set of disconnected ver-tices selected from a large graph. A graph mining algorithm might simply output aggregated statistics mined from the graph.（通常pregel的输出是是一个图，每个节点上面都有对应的value，图和原图是同构的。但是也不排除一些算法会修改图的结构，比如簇集算法或者图挖掘算法等）
</li>
<li>We chose a pure message passing model, omitting remote reads and other ways of emulating shared memory, for two reasons. （选择消息传递模型而不是模拟共享内存的方式，主要有下面两点原因）
<ul>
<li>First, message passing is sufficiently expressive that there is no need for remote reads. We have not found any graph algorithms for which message passing is insufficient. （够用）
</li>
<li>Second, this choice is better for performance. In a cluster environment, reading a value from a remote machine in-curs high latency that can’t easily be hidden. Our message passing model allows us to amortize latency by delivering messages asynchronously in batches.（能够隐藏一些延迟，比如能够通过batch方式，并且进行异步发送）
</li>
</ul>

</li>
<li>Graph algorithms can be written as a series of chained MapReduce invocations [11, 30]. We chose a different model for reasons of usability and performance. （虽然pregel可以使用系列的MR完成，但是考虑可用性以及性能使用另外模型）：
<ul>
<li>Pregel keeps ver-tices and edges on the machine that performs computation, and uses network transfers only for messages. （所有节点和边都是保存好的）
</li>
<li>MapReduce, however, is essentially functional, so expressing a graph algo-rithm as a chained MapReduce requires passing the entire state of the graph from one stage to the next—in general requiring much more communication and associated serial-ization overhead（虽然MR是函数式的，但是每次都需要传递整个graph数据结构，这样会给通信以及序列话带来很多额外的开销）
</li>
<li>In addition, the need to coordinate the steps of a chained MapReduce adds programming complex-ity that is avoided by Pregel’s iteration over supersteps.（使用MR还需要其他协调机制来保证同步，而pregel可以通过基于superstep的iteration来解决）
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> The C++ API</h3>
<div class="outline-text-3" id="text-1-4">




<pre class="src src-C++">template &lt;typename VertexValue,
          typename EdgeValue,
          typename MessageValue&gt;
class Vertex {
 public:
  virtual void Compute(MessageIterator* msgs) = 0; // &#21487;&#20197;&#36845;&#20195;&#21457;&#36865;&#32473;&#36825;&#20010;&#33410;&#28857;&#30340;&#28040;&#24687;
  const string&amp; vertex_id() const; // &#33258;&#36523;
  int64 superstep() const; // &#36845;&#20195;&#27425;&#25968;
  const VertexValue&amp; GetValue(); // &#33258;&#36523;hold value&#65292;custom&#12290;
  VertexValue* MutableValue();
  OutEdgeIterator GetOutEdgeIterator(); // out going vertices&#12290;&#36825;&#20010;&#20063;&#31639;&#26159;vertex hold value&#65292;builtin&#12290;
  void SendMessageTo(const string&amp; dest_vertex, // &#32473;&#26576;&#20010;&#33410;&#28857;&#21457;&#36865;&#28040;&#24687;
                     const MessageValue&amp; message);
  void VoteToHalt(); // vote to halt
};
</pre>

<ul>
<li>The values associated with the vertex and its edges are the only per-vertex state that persists across supersteps. Lim-iting the graph state managed by the framework to a single value per vertex or edge simplifies the main computation cycle, graph distribution, and failure recovery.（一个节点持有的value以及对应的edges是每次superstep需要保存的东西，这样可以简化框架所需要完成的工作，包括计算，图分布以及故障恢复）
</li>
</ul>



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Message Passing</h4>
<div class="outline-text-4" id="text-1-4-1">

<ul>
<li>When the destination vertex of any message does not ex-ist, we execute user-defined handlers. A handler could, for example, create the missing vertex or remove the dangling edge from its source vertex. <b>TODO（dirlt）：这点很重要，但是似乎做得不是很好。首先vertex应该是知道哪些节点是存在还是不存在的，不过这还是有一个问题，就是如何保证原子操作。因为可能有多个vertex会创建相同节点。另外就是这handler仅仅是在dest vertex不存在的时候才调用的，不能够主动地出发删除edge的操作</b> 
<ul>
<li>我的理解是直接提供添加和删除vertex的接口，但是需要考虑到有多个节点共同操作的问题。 <b>NOTE（dirlt）：不过我看论文后面也讨论了这个问题</b>
</li>
<li>后面倒是说明白了，handler接口仅仅是为了在冲突的时候调用的，而并不是类似于回调的机制。
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Combiners</h4>
<div class="outline-text-4" id="text-1-4-2">

<ul>
<li>这个概念和MR里面非常类似，能够有效地减少数据传输量。我猜想combiner工作集合应该是节点发送给某个节点所有消息。
</li>
<li>There are no guarantees about which (if any) messages are combined, the groupings presented to the combiner, or the order of combining, so combiners should only be enabled for commutative and associative operations.（对于combiner不应该有太多的假设，包括消息个数，顺序以及如何进行group的，因此combiner本身的计算应该满足交换律和结合律）
</li>
</ul>


</div>

</div>
